cask_args appdir: '/Applications'

# taps
tap 'azure/draft' || true
tap 'beeftornado/rmtree' || true
tap 'buo/cask-upgrade' || true
tap 'epk/epk' || true
tap 'github/gh' || true
tap 'golangci/tap' || true
tap 'homebrew/bundle' || true
tap 'homebrew/cask' || true
tap 'homebrew/cask-drivers' || true
tap 'homebrew/cask-fonts' || true
tap 'homebrew/cask-versions' || true
tap 'homebrew/core' || true

# fonts
cask 'font-meslo-nerd-font'
cask 'font-sf-mono-nerd-font'

# version control
brew 'gist'
brew 'git'
brew 'hub'
brew 'gh'

# languages
brew 'go'
brew 'node'
brew 'python'
brew 'ruby-build'
brew 'rust'
cask 'java'

# utilities
brew 'autoconf'
brew 'automake'
brew 'autojump'
brew 'awk'
brew 'bash'
brew 'bat'
brew 'cmake'
brew 'coreutils'
brew 'diff-so-fancy'
brew 'dive'
brew 'draft'
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'openssl'
brew 'jq'
brew 'kubectx'
brew 'kustomize'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'lsd'
brew 'markdown'
brew 'mas'
brew 'mysql'
brew 'nano'
brew 'nmap'
brew 'neovim'
brew 'octant'
brew 'protobuf'
brew 'ripgrep'
brew 'shellcheck'
brew 'skaffold'
brew 'stern'
brew 'tmux'
brew 'watch'
brew 'wget'
brew 'yamllint'
brew 'yq'
brew 'zlib'
brew 'zsh'

# applications
cask '1password'
cask 'alacritty'
cask 'aerial'
cask 'appcleaner'
cask 'beardedspice'
cask 'docker-edge'
cask 'google-chrome'
cask 'go2shell'
cask 'google-cloud-sdk'
cask 'gpg-suite'
cask 'iterm2'
cask 'ngrok'
cask 'open-in-code'
cask 'rectangle'
cask 'visual-studio-code'
cask 'vlc'
cask 'yubico-authenticator'
cask 'zoomus'

# appstore apps
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Wipr', id: 1320666476
